<?php
  return [
    'hc_patient_type' => [
      '1'=>'一般居護','2'=>'四階(IDS)','3'=>'安寧舊制','4'=>'居整','5'=>'居整(呼吸器)','6'=>'居整(安寧)','7'=>'HAH','8'=>'自費','9'=>'長照2.0'
    ],
    'gender_text' => [
      '0'=>'女生','1'=>'男生','2'=>'其他'
    ],
    'gender' => [
      '0'=>'<span style="color:red;"><i class="bi bi-gender-female"></i></span>','1'=>'<span style="color:blue;"><i class="bi bi-gender-male"></i></span>','2'=>'<span style="color:color:#6aa84f;"><i class="bi bi-gender-ambiguous"></i></span>'
    ],
    'hc_close_reason' => [
      '1'=>'死亡','2'=>'情況好轉','3'=>'入住長期照護機構','4'=>'搬離服務範圍','5'=>'轉其他居護單位','6'=>'其他'
    ],
    'hc_treatment_category' => [
      '0'=>'醫療服務費','1'=>'特殊材料費','2'=>'不得計價的診療費用或材料','3'=>'停用'
    ],
    'nhi_array' => [ 
      '1'=>array("d1"=>"A1","d4"=>"","d8"=>"EA","d14"=>"4"),
      '2'=>array("d1"=>"A1","d4"=>"","d8"=>"AC","d14"=>"9"),
      '3'=>array("d1"=>"A5","d4"=>"","d8"=>"EA","d14"=>"4"),
      '4'=>array("d1"=>"A1","d4"=>"EC","d8"=>"EA","d14"=>"4"),
      '5'=>array("d1"=>"A1","d4"=>"EC","d8"=>"AC","d14"=>"9"),
      '6'=>array("d1"=>"A5","d4"=>"EC","d8"=>"EA","d14"=>"4"),
      '7'=>array("d1"=>"E1","d4"=>"EN","d8"=>"EA","d14"=>"4")  //在宅急症照護，案件分類一律填 E1，特定治療項目代碼填EN
    ],  //d1:案件分類，d4:特療項目，d8:科別，d14:給付類別
  ];