<?php
  // 在Blade中要使用陣列，
  // @foreach (getOptionList('CaseSource') as $val => $text)
  // <option value="{{ $val }}">{{ $text }}</option>
  // @endforeach
  if (! function_exists('getOptionList')) {
    function getOptionList($key)
    {
      return getOptions()[$key] ?? [];
    }
  } 

//要調用已經設定在Helpers/helpers.php
  if (! function_exists('getOptions')) {
    function getOptions(): array
    {
      return [
        'CaseSource' => [
          '1' => '簽約醫院轉介',
          '2' => '非簽約醫院轉介',
          '3' => '照管中心',
          '4' => '自行尋求',
          '5' => '其他',
        ],
        'CaseType' => [
          '1' => '非足部護理',
          '2' => '足部護理',
        ],
        'Education' => [
          '1' => '不識字',
          '2' => '識字未就學',
          '3' => '小學',
          '4' => '初中(職)',
          '5' => '高中(職)',
          '6' => '大學(專技)以上',
          '7' => '其他',
        ],
        'Marriage' => [
          '1' => '未婚',
          '2' => '已婚',
          '3' => '分居',
          '4' => '喪偶',
          '5' => '離異',
          '6' => '其他',
        ],
        'Religion' => [
          '1' => '無',
          '2' => '佛教',
          '3' => '道教或民間傳統信仰',
          '4' => '基督教',
          '5' => '天主教',
          '6' => '一貫道',
          '7' => '回教',
          '8' => '其他',
        ],
        'ExJob' => [
          '1' => '無',
          '2' => '工商服務業',
          '3' => '交通運輸業',
          '4' => '漁農牧業',
          '5' => '軍公教',
          '6' => '家管',
          '7' => '其他',
        ],
        'Economic' => [
          '1' => '富裕',
          '2' => '小康',
          '3' => '貧窮',
          '4' => '其他',
        ],
        'Welfare' => [
          '1' => '低收入戶',
          '2' => '中低收入戶',
          '3' => '身障證明',
          '4' => '重大傷病卡',
          '5' => '其他',
        ],
        'DisabilityType' => [
          '1' => '第一類-神經系統構造及精神、心智功能',
          '2' => '第二類-眼、耳及相關構造與感官功能及疼痛',
          '3' => '第三類-涉及聲音與言語構造及其功能',
          '4' => '第四類-循環、造血、免疫與呼吸系統構造及其功能',
          '5' => '第五類-消化、新陳代謝與內分泌系統相關構造及其功能',
          '6' => '第六類-泌尿與生殖系統相關構造及其功能',
          '7' => '第七類-神經、肌肉、骨骼之移動相關構造及其功能',
          '8' => '第八類-皮膚與相關構造及其功能',
        ],
        'CaregiverID' => [
          '1' => '自己',
          '2' => '配偶',
          '3' => '子女',
          '4' => '看護',
          '5' => '其他',
        ],
        'EgyContactRelation' => [
          '1' => '配偶',
          '2' => '子女',
          '3' => '其他',
        ],
        'DecisionMakerRelation' => [
          '1' => '自己',
          '2' => '配偶',
          '3' => '子女',
          '4' => '機構人員',
          '5' => '其他',
        ],
        'MEventItem' => [
          '1' => '親友死亡',
          '2' => '身體疾病',
          '3' => '被騙錢',
          '4' => '其他',
        ],
        'JobTitle' => [
          '1' => '護理師',
          '2' => '護士',
          '3' => '呼吸治療師',
          '4' => '藥師',
          '5' => '藥生',
          '6' => '醫師',
          '7' => '職能治療師',
          '8' => '職能治療生',
          '9' => '物理治療師',
          '10' => '物理治療生',
          '11' => '營養師',
          '12' => '心理師',
          '13' => '其他',
        ],
        'Relationship' => [
          '1' => '父親',
          '2' => '母親',
          '3' => '配偶',
          '4' => '兄',
          '5' => '弟',
          '6' => '姊',
          '7' => '妹',
          '8' => '兒子',
          '9' => '女兒',
          '10' => '媳婦',
          '11' => '女婿',
          '12' => '孫子',
          '13' => '孫女',
          '14' => '朋友',
          '15' => '本籍看護',
          '16' => '外籍看護',
          '17' => '里長',
          '18' => '其他',
        ],
        'CareTime' => [
          '1' => '白天',
          '2' => '晚上',
          '3' => '其他',
        ],
      ];
    }
  }